controllers/ClienteController.php

    protected function findModel($id)
    {
        if (($model = Cliente::findOne($id)) !== null) {
---
SELECT * FROM "bcl"."cliente" WHERE "id"='1'