controllers/FabricacaoController.php

    public function actionCreate() {

        $model = new FabricacaoSearch();
        $modelHitorico = new \app\models\FabricacaoHistoricoSearch();
        $this->view->title = "Cadastrar Estoque de Fabricação";

	$produto = \app\models\VisProdutoComercialSearch::find()->select(['produto_comercial as value', 'produto_comercial as  label', 'id as id'])->asArray()->all();

        $status = [1 => 'Riscado', 2 => 'Bordando Terceiros', 3 => 'Bordado', 4 => 'Pronto'];

        if (Yii::$app->request->post()) {
            $model->load(Yii::$app->request->post());


            $modelExiste = Fabricacao::findOne(['produto_comercial_fk' => $model->produto_comercial_fk, 'status' => $model->status]);
---
SELECT "produto_comercial" AS "value", "produto_comercial" AS "label", "id" AS "id" FROM "bcl"."vis_produto_comercial"
SELECT EXISTS(SELECT * FROM "bcl"."produto_comercial" WHERE ("id"='11'))
SELECT * FROM "bcl"."fabricacao" WHERE ("produto_comercial_fk"='11') AND ("status"='1')

    public function actionMudaStatus($id) {

        $model = \app\models\VisFabricacaoSearch::findOne(['id'=>$id]);
        $modelNovo = new Fabricacao();
        $modelHitorico = new \app\models\FabricacaoHistoricoSearch();

        $produto = ArrayHelper::map(\app\models\VisProdutoComercialSearch::find()->select("id, produto_comercial")->orderBy('produto_comercial')->all(), 'id', 'produto_comercial');
---
SELECT "id", "produto_comercial" FROM "bcl"."vis_produto_comercial" ORDER BY "produto_comercial"