controllers/FabricacaoHistoricoController.php

    public function actionUpdate($id) {
        $model = $this->findModel($id);
        if (Yii::$app->request->post()) {
            $post = Yii::$app->request->post();
            if ($post['FabricacaoHistoricoSearch']['qnt'] == $model->qnt) {
                $model->load($post);
                $model->save();
            } else {
                $modelHitorico = new \app\models\FabricacaoHistoricoSearch();
                $modelHitorico->load(Yii::$app->request->post());
                $fabricacao = \app\models\FabricacaoSearch::findOne(['id' => $model->fabricacao_fk]);

                if ($post['FabricacaoHistoricoSearch']['qnt'] > $model->qnt) {

                    $modelHitorico->qnt = ($post['FabricacaoHistoricoSearch']['qnt'] - $model->qnt);
                    $modelHitorico->status = '1';
                    $fabricacao->qnt = $fabricacao->qnt + $modelHitorico->qnt;
                } else {

                    $modelHitorico->qnt = ($model->qnt - $post['FabricacaoHistoricoSearch']['qnt']);
                    $modelHitorico->status = '2';
                    $fabricacao->qnt = $fabricacao->qnt - $modelHitorico->qnt;
                }
                $modelHitorico->fabricacao_fk = $model->fabricacao_fk;
                $modelHitorico->pessoa = 'Ajuste Sistema';
                $modelHitorico->save();
                $model->load($post);
                $fabricacao->save();
---
SELECT * FROM "bcl"."fabricacao" WHERE "id"='28'
UPDATE "bcl"."fabricacao" SET "qnt"=-4 WHERE "id"='28'