controllers/FabricacaoController.php

SELECT "produto_preco_fk", "descricao" FROM "bcl"."vis_produto" ORDER BY "descricao"
INSERT INTO "bcl"."fabricacao" ("produto_comercial_fk", "qnt", "status") VALUES ('20', 10, 1) RETURNING "id"
UPDATE "bcl"."fabricacao" SET "qnt"=34 WHERE "id"='14'
---
    public function actionCreate() {

        $model = new Fabricacao();
        $modelHitorico = new \app\models\FabricacaoHistoricoSearch();

        $produto = ArrayHelper::map(\app\models\VisProduto::find()->select("produto_preco_fk, descricao")->orderBy('descricao')->all(), 'produto_preco_fk', 'descricao');
        $classificacao = ArrayHelper::map(\app\models\ClassificacaoSearch::find()->select("id, descricao")->orderBy('descricao')->all(), 'id', 'descricao');
        $desenho = ArrayHelper::map(\app\models\DesenhoSearch::find()->select("id, descricao")->orderBy('descricao')->all(), 'id', 'descricao');
        $status = [1 => 'Riscado', 2 => 'Bordando Terceiros', 3 => 'Bordado', 4 => 'Pronto'];

        if (Yii::$app->request->post()) {
            $model->load(Yii::$app->request->post());
            $modelExiste = Fabricacao::findOne(['classificacao_fk' => $model->classificacao_fk, 'produto_preco_fk' => $model->produto_preco_fk, 'desenho_fk' => $model->desenho_fk, 'status' => $model->status]);


            if ($modelExiste) {

                $qtd = $model->qnt;
                $modelExiste->qnt = $modelExiste->qnt + $model->qnt;
                $model = $modelExiste;
            } else {

                $qtd = $model->qnt;
            }

            if ($model->save()) {

SELECT "produto_preco_fk", "descricao" FROM "bcl"."vis_produto" ORDER BY "descricao"
---
    public function actionUpdate($id) {
        $model = $this->findModel($id);
        $modelHitorico = new \app\models\FabricacaoHistoricoSearch();

        $produto = ArrayHelper::map(\app\models\VisProduto::find()->select("produto_preco_fk, descricao")->orderBy('descricao')->all(), 'produto_preco_fk', 'descricao');

SELECT "produto_preco_fk", "descricao" FROM "bcl"."vis_produto" ORDER BY "descricao"
SELECT EXISTS(SELECT * FROM "bcl"."classificacao" WHERE ("id"='51'))
SELECT EXISTS(SELECT * FROM "bcl"."desenho" WHERE ("id"='22'))
SELECT EXISTS(SELECT * FROM "bcl"."produto_preco" WHERE ("id"='1'))
SELECT * FROM "bcl"."fabricacao" WHERE ("classificacao_fk"='51') AND ("produto_preco_fk"='1') AND ("desenho_fk"='22') AND ("status"='2')
---
    public function actionMudaStatus($id) {
        $model = $this->findModel($id);
        $modelNovo = new Fabricacao();
        $modelHitorico = new \app\models\FabricacaoHistoricoSearch();

        $produto = ArrayHelper::map(\app\models\VisProduto::find()->select("produto_preco_fk, descricao")->orderBy('descricao')->all(), 'produto_preco_fk', 'descricao');
        $classificacao = ArrayHelper::map(\app\models\ClassificacaoSearch::find()->select("id, descricao")->orderBy('descricao')->all(), 'id', 'descricao');
        $desenho = ArrayHelper::map(\app\models\DesenhoSearch::find()->select("id, descricao")->orderBy('descricao')->all(), 'id', 'descricao');

        $status = [1 => 'Riscado', 2 => 'Bordando Terceiros', 3 => 'Bordado', 4 => 'Pronto'];

        unset($status[$model->status]);

        if ($modelNovo->load(Yii::$app->request->post())) {
           $modelNovo->classificacao_fk = $model->classificacao_fk;
           $modelNovo->produto_preco_fk = $model->produto_preco_fk;
           $modelNovo->desenho_fk = $model->desenho_fk;

            $modelExiste = Fabricacao::findOne(['classificacao_fk' => $model->classificacao_fk, 'produto_preco_fk' => $model->produto_preco_fk, 'desenho_fk' => $model->desenho_fk, 'status' => $modelNovo->status]);