controllers/FabricacaoHistoricoController.php

SELECT * FROM "bcl"."fabricacao_historico" WHERE "id"='6'
---
    protected function findModel($id)
    {
        if (($model = FabricacaoHistorico::findOne($id)) !== null) {