controllers/ProdutoController.php

    protected function findModel($id)
    {
        if (($model = Produto::findOne($id)) !== null) {
---
SELECT * FROM "bcl"."produto" WHERE "id"='51'